Revit 2027 API
Application.DocumentSynchronizingWithCentral Event
 Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<DocumentSynchronizingWithCentralEventArgs> DocumentSynchronizingWithCentral
Public Event DocumentSynchronizingWithCentral As EventHandler(Of DocumentSynchronizingWithCentralEventArgs)
public:
 event EventHandler<DocumentSynchronizingWithCentralEventArgs^>^ DocumentSynchronizingWithCentral {
	void add (EventHandler<DocumentSynchronizingWithCentralEventArgs^>^ value);
	void remove (EventHandler<DocumentSynchronizingWithCentralEventArgs^>^ value);
}
member DocumentSynchronizingWithCentral : IEvent<EventHandler<DocumentSynchronizingWithCentralEventArgs>,
    DocumentSynchronizingWithCentralEventArgs>
Value
EventHandler<DocumentSynchronizingWithCentralEventArgs>
Remarks
This event is raised when Revit is just about to synchronize a document with central model.
 Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode.
Event is cancellable. To cancel it, call the 'Cancel()' method in event's argument to True. Your application is responsible for providing feedback to the user about the reason for the cancellation.
The following API functions are not available for the current document during this event:
Close() and similar overloads.
Save() .
SaveAs(String) and similar overloads.
Exception InvalidOperationException will be thrown if any of the above methods is called during this event.
Another DocumentSynchronizedWithCentral event will be raised immediately after document synchronizing with central model is finished.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace